Examinator/src/InformationRegisters/СоставыГруппПроведенийОбученияСУО/СоставыГруппПроведенийОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставыГруппПроведенийОбученияСУО</name>
  <dimensions>
    <name>ГруппаПроведенийОбучения</name>
    <type>
      <types>CatalogRef.ГруппыПроведенийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ПродолжительностьОбученияСУО/ПродолжительностьОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПродолжительностьОбученияСУО</name>
  <enumValues>
    <name>Фиксированная</name>
  </enumValues>
  <enumValues>
    <name>СНачалаОбучения</name>
  </enumValues>
  <enumValues>
    <name>СЗачисления</name>
  </enumValues>
  <enumValues>
    <name>НеЗадана</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ПроведениеПреподавателемОбученияСУО/ПроведениеПреподавателемОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПреподавателемОбученияСУО</name>
  <registerRecords>InformationRegister.ПроведениеПреподавателямиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.РасписаниеПреподавателейСУО</registerRecords>
  <registerRecords>InformationRegister.ПреподавателиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПроведение</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьОтУченика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПросмотрВедомости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/InformationRegisters/СоставыГруппПроведенийОбученияСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ПоместитьВГруппу(Знач ПроведениеОбучения, Знач Группа) Экспорт
	
	ПроверитьВозможностьИзменятьСоставГруппы(Группа);
	
	Запись = РегистрыСведений.СоставыГруппПроведенийОбученияСУО.СоздатьМенеджерЗаписи();
	Запись.ГруппаПроведенийОбучения = Группа;
	Запись.ПроведениеОбучения = ПроведениеОбучения;
	Запись.Записать();
	
КонецПроцедуры

Процедура УдалитьИзГруппы(Знач ПроведениеОбучения, Знач Группа) Экспорт
	
	ПроверитьВозможностьИзменятьСоставГруппы(Группа);
	
	Набор = РегистрыСведений.СоставыГруппПроведенийОбученияСУО.СоздатьНаборЗаписей();
	Набор.Отбор.ГруппаПроведенийОбучения.Установить(Группа);
	Набор.Отбор.ПроведениеОбучения.Установить(ПроведениеОбучения);	
	Набор.Записать();
	
КонецПроцедуры

Процедура ПроверитьВозможностьИзменятьСоставГруппы(Знач Группа)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Группа, "Предопределенный") Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно изменить состав предопределенной группы'");
	КонецЕсли;
	
КонецПроцедуры

Функция ПроведенияОбученияГруппы(Знач Группа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставыГрупп.ПроведениеОбучения КАК ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГрупп
		|ГДЕ
		|	СоставыГрупп.ГруппаПроведенийОбучения = &Группа";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПроведениеОбучения");
	
КонецФункции

Функция ЕстьОбученияСПрограммойОбучения(Знач Группа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоставыГрупп.ПроведениеОбучения КАК ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГрупп
		|ГДЕ
		|	СоставыГрупп.ГруппаПроведенийОбучения = &Группа
		|	И СоставыГрупп.ПроведениеОбучения.ПроведениеПрограммыОбучения <> &ПроведениеПрограммыОбученияПустаяСсылка
		|	И СоставыГрупп.ПроведениеОбучения.Статус <> &СтатусОтменено
		|	И СоставыГрупп.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбученияПустаяСсылка", Документы.ПроведениеПрограммыОбученияСУО.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция Пустая(Знач Группа, Знач ИсключитьОтмененныеИПомеченныеНаУдаление = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ИсключитьОтмененныеИПомеченныеНаУдаление Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СоставыГрупп.ПроведениеОбучения КАК ПроведениеОбучения
			|ИЗ
			|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГрупп
			|ГДЕ
			|	СоставыГрупп.ГруппаПроведенийОбучения = &Группа
			|	И СоставыГрупп.ПроведениеОбучения.Статус <> &СтатусОтменено
			|	И СоставыГрупп.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СоставыГрупп.ПроведениеОбучения КАК ПроведениеОбучения
			|ИЗ
			|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГрупп
			|ГДЕ
			|	СоставыГрупп.ГруппаПроведенийОбучения = &Группа";
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Группа", Группа);
	
	Возврат Запрос.Выполнить().Пустой();	
	
КонецФункции

Функция ПервоеПроведениеОбученияГруппы(Знач Группа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения КАК ПроведениеОбучения,
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ДатаНачалаПроведения КАК ДатаНачала,
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.СкрытьВремяПроведения КАК СкрытьВремя
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГруппПроведенийОбученияСУО
		|ГДЕ
		|	СоставыГруппПроведенийОбученияСУО.ГруппаПроведенийОбучения = &Группа
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ВариантПродолжительности = &ВариантПродолжительности
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ДатаНачалаПроведения <> &ПустаяДата
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.Статус <> &СтатусОтменено
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ВариантПродолжительности", Перечисления.ПродолжительностьОбученияСУО.Фиксированная);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	
	ТаблицаОбучений = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения КАК ПроведениеОбучения,
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ДатаНачалаДоступа КАК ДатаНачала,
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.СкрытьВремяПроведения КАК СкрытьВремя
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГруппПроведенийОбученияСУО
		|ГДЕ
		|	СоставыГруппПроведенийОбученияСУО.ГруппаПроведенийОбучения = &Группа
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ВариантПродолжительности = &ВариантПродолжительности
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ДатаНачалаДоступа <> &ПустаяДата
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.Статус <> &СтатусОтменено
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ВариантПродолжительности", Перечисления.ПродолжительностьОбученияСУО.Фиксированная);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), ТаблицаОбучений);
	
	Если ТаблицаОбучений.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаОбучений.Сортировать("ДатаНачала");
	
	РезультатСтруктура = УправлениеОбучениемСУО.ПервоеПроведенияОбученияПустаяСтруктура();
	РезультатСтруктура.Вставить("ПроведениеОбучения", ТаблицаОбучений[0].ПроведениеОбучения);
	РезультатСтруктура.Вставить("ДатаНачала", ТаблицаОбучений[0].ДатаНачала);
	РезультатСтруктура.Вставить("СкрытьВремя", ТаблицаОбучений[0].СкрытьВремя);
	
	Возврат РезультатСтруктура;
	
КонецФункции

Функция ПреподавателиГруппы(Знач Группа) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения КАК ПроведениеОбучения
		|ПОМЕСТИТЬ ПроведенияОбученияГруппы
		|ИЗ
		|	РегистрСведений.СоставыГруппПроведенийОбученияСУО КАК СоставыГруппПроведенийОбученияСУО
		|ГДЕ
		|	СоставыГруппПроведенийОбученияСУО.ГруппаПроведенийОбучения = &Группа
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.Статус <> &СтатусОтменено
		|	И СоставыГруппПроведенийОбученияСУО.ПроведениеОбучения.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроведениеПреподавателемОбученияСУО.Пользователь КАК Пользователь
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения В
		|			(ВЫБРАТЬ
		|				ПроведенияОбученияГруппы.ПроведениеОбучения
		|			ИЗ
		|				ПроведенияОбученияГруппы)";
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

#КонецОбласти

#КонецЕсли
